anthropic.claude-code
anysphere.cursorpyright
bradlc.vscode-tailwindcss
dart-code.dart-code
dart-code.flutter
dbaeumer.vscode-eslint
esbenp.prettier-vscode
ms-ceintl.vscode-language-pack-ko
ms-python.debugpy
ms-python.python
ms-vscode.vscode-typescript-next
nrwl.angular-console
openai.chatgpt
vue.volar
